In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('https://raw.githubusercontent.com/plotly/datasets/refs/heads/master/titanic.csv')

In [8]:
df.loc[155, 'Name']

'Williams, Mr. Charles Duane'

In [14]:
df.loc[150:155, ['Name', 'Sex']]

                                  Name     Sex
150         Bateman, Rev. Robert James    male
151  Pears, Mrs. Thomas (Edith Wearne)  female
152                   Meo, Mr. Alfonzo    male
153    van Billiard, Mr. Austin Blyler    male
154              Olsen, Mr. Ole Martin    male
155        Williams, Mr. Charles Duane    male

In [10]:
df.iloc[155, 3]

'Williams, Mr. Charles Duane'

In [12]:
df.iloc[-3:, 3]

153    van Billiard, Mr. Austin Blyler
154              Olsen, Mr. Ole Martin
155        Williams, Mr. Charles Duane
Name: Name, dtype: object

In [15]:
df[['Name', 'Sex']].iloc[150:155]

                                  Name     Sex
150         Bateman, Rev. Robert James    male
151  Pears, Mrs. Thomas (Edith Wearne)  female
152                   Meo, Mr. Alfonzo    male
153    van Billiard, Mr. Austin Blyler    male
154              Olsen, Mr. Ole Martin    male